{"nbformat":4,"nbformat_minor":0,"metadata":{"kernelspec":{"display_name":"Python 3","language":"python","name":"python3"},"language_info":{"codemirror_mode":{"name":"ipython","version":3},"file_extension":".py","mimetype":"text/x-python","name":"python","nbconvert_exporter":"python","pygments_lexer":"ipython3","version":"3.6.5"},"colab":{"name":"exercise_content_syntax.ipynb","provenance":[]}},"cells":[{"cell_type":"markdown","metadata":{"id":"Rjf5jP28-rib"},"source":["# Упражнения на методы списков\n","\n","## Задание 1\n","Напишите программу, которая удаляет дубликаты из списка (в этой задаче нельзя пользоваться множествами)."]},{"cell_type":"code","metadata":{"id":"ECBStl2g-ric","colab":{"base_uri":"https://localhost:8080/"},"executionInfo":{"status":"ok","timestamp":1645001995704,"user_tz":-180,"elapsed":6,"user":{"displayName":"juan camilo suarez","photoUrl":"https://lh3.googleusercontent.com/a-/AOh14Gj5WRz0Cgj8kbZDQV-feMeWnzIPYW10B6W-dmcexg=s64","userId":"11862920598419418007"}},"outputId":"a137a3dd-d9f7-4007-a782-b81810b518eb"},"source":["test_list = [2, 3, 6, 8, 19, 21, 22, 3, 3, 5, 20, 21]\n","\n","# Решение ниже\n","resultantList = []\n"," \n","for element in test_list:\n","    if element not in resultantList:\n","        resultantList.append(element)\n","\n","print(resultantList)"],"execution_count":1,"outputs":[{"output_type":"stream","name":"stdout","text":["[2, 3, 6, 8, 19, 21, 22, 5, 20]\n"]}]},{"cell_type":"markdown","metadata":{"id":"Mbb2962o-ric"},"source":["## Задание 2\n","Напишите программу, которая в каждом подлисте находит максмум и суммирует их."]},{"cell_type":"code","metadata":{"id":"_UUEwCuG-ric","colab":{"base_uri":"https://localhost:8080/"},"executionInfo":{"status":"ok","timestamp":1645002633515,"user_tz":-180,"elapsed":266,"user":{"displayName":"juan camilo suarez","photoUrl":"https://lh3.googleusercontent.com/a-/AOh14Gj5WRz0Cgj8kbZDQV-feMeWnzIPYW10B6W-dmcexg=s64","userId":"11862920598419418007"}},"outputId":"e948a7bd-4910-4add-c6b7-65219934b331"},"source":["test_list = [[1,2,3], [4,5,6], [10,11,12], [7,8,9]]\n","sum = 0\n","for x in test_list:\n","  print(\"max in this list\",max(x))\n","  for y in x:\n","    sum  = y + sum\n","  print(\"sum in this list\",sum)"],"execution_count":8,"outputs":[{"output_type":"stream","name":"stdout","text":["max in this list 3\n","sum in this list 6\n","max in this list 6\n","sum in this list 21\n","max in this list 12\n","sum in this list 54\n","max in this list 9\n","sum in this list 78\n"]}]},{"cell_type":"markdown","metadata":{"id":"i4qiB0RM-rid"},"source":["## Задание 3\n","Есть список x. Нужно посчитать количество нечетных элементов с использованием метода .pop() .pop() дает возможность одновременно удалить элемент (список занимает меньше места в памяти) и сохранить его в переменной."]},{"cell_type":"code","metadata":{"id":"Mz1bOFoO-rid","colab":{"base_uri":"https://localhost:8080/"},"executionInfo":{"status":"ok","timestamp":1645006689157,"user_tz":-180,"elapsed":263,"user":{"displayName":"juan camilo suarez","photoUrl":"https://lh3.googleusercontent.com/a-/AOh14Gj5WRz0Cgj8kbZDQV-feMeWnzIPYW10B6W-dmcexg=s64","userId":"11862920598419418007"}},"outputId":"e67d03c6-fbab-4e44-aafe-f414061ad21e"},"source":["x = [1,2,3,4,5,6,7]\n","print(len([elem for elem in x if elem % 2 != 0]))"],"execution_count":28,"outputs":[{"output_type":"stream","name":"stdout","text":["4\n"]}]},{"cell_type":"markdown","metadata":{"id":"5T0dvab7-rid"},"source":["# Упражнение на работу со словарями\n","\n","## Задание 1\n","\n","Файл mbox.txt содержит метаданные почтового сервера.\n","Мы знаем, что строка с адресом автора письма начинается с \"From \" (посмотрите в самом файле по ссылке http://www.py4inf.com/code/mbox.txt,\n","какие там еще есть варианты). Мы хотим найти адреса всех авторов сообщений и найти того из них, кто пишет\n","больше всех писем."]},{"cell_type":"code","metadata":{"id":"WHk3LYoL-rie","executionInfo":{"status":"ok","timestamp":1645006210147,"user_tz":-180,"elapsed":732,"user":{"displayName":"juan camilo suarez","photoUrl":"https://lh3.googleusercontent.com/a-/AOh14Gj5WRz0Cgj8kbZDQV-feMeWnzIPYW10B6W-dmcexg=s64","userId":"11862920598419418007"}}},"source":["# импортируем библиотеку для доступа к файлам в интернете\n","import requests\n","# в переменной mbox хранится текст для работы\n","mbox = requests.get('http://www.py4inf.com/code/mbox.txt').text\n","\n","# решение ниже\n","\n"],"execution_count":27,"outputs":[]}]}